# Ім'я вихідного файлу (назва програми)
TARGET = watchman

# Компілятор та флаги
CC = gcc
CFLAGS = -Wall -Wextra -std=c11

# Джерельні файли та об'єктні файли
SRC = watchman.c
OBJ = $(SRC:.c=.o)

# Правило за замовчуванням (збірка програми)
all: $(TARGET)

# Правило для збірки виконуваного файлу
$(TARGET): $(OBJ)
	$(CC) $(CFLAGS) -o $(TARGET) $(OBJ)

# Правило для збірки об'єктних файлів
%.o: %.c
	$(CC) $(CFLAGS) -c $< -o $@

# Правило для очищення скомпільованих файлів
clean:
	rm -f $(OBJ) $(TARGET)

# Додаткові цілі не є файлами
.PHONY: all clean
